{
  "skills": [
    "HTML",
    "CSS",
    "JavaScript(ES6)",
    "TypeScript",
    "Vue.js",
    "RESTful API",
    "Socket.io",
    "Element-Plus",
    "Tailwind CSS",
    "Pinia",
    "Git",
    "ESLint",
    "AstroJs",
    "Figma"
  ],
  "sideproject" : "SIDE PROJECTS ( Showcased on GitHub )",
  "social": [
    {
      "name": "linkedin",
      "link": "https://www.linkedin.com/in/jackywu1216/",
      "title": "jackywu1216"
    },
    {
      "name": "github",
      "link": "https://github.com/crazwade",
      "title": "crazwade"
    },
    {
      "name": "email",
      "link": "jackywu526@gmail.com",
      "title": "jackywu526@gmail.com"
    }
  ],
  "setting": {
    "title": "Setting",
    "lang": "Language Setting",
    "pdf": "Export PDF"
  },
  "info" : {
    "name": "Jacky Wu",
    "degree": "B.S., Information Management, University of Kaohsiung, Grad. 2019"
  },
  "experience": [
    {
      "company": "Sakawa Technology Co., LTD.",
      "time": "Oct 2021 - Present",
      "title": "Frontend Developer",
      "local": "Kaohsiung",
      "skill": [
        "Vue.js",
        "TypeScript(Vue3)",
        "JavaScript(ES6)",
        "AstroJs",
        "RESTful API",
        "Socket.io",
        "Element-Plus",
        "Tailwind CSS",
        "ESLint",
        "Pinia",
        "Figma"
      ],
      "content": [
        "Collaborated with cross-functional teams, including backend engineers, graphic designers, and project managers",
        "Executed production based on specifications and collaborated with backend engineers to discuss API structures, meeting interface integration requirements",
        "In large-scale projects, focusing on middleware tasks. Responsible for creating API interfaces, converting data types, and handling functions for API requests and payloads between frontend and backend",
        "Proficient in writing logic layer code based on frontend UX and integrating UI components"
      ],
      "link": "https://www.sakawa.com.tw/"
    },
    {
      "company": "AppleBuds Inc.",
      "time": "Oct 2019 - Present",
      "title": "Programming Instructor",
      "local": "Kaohsiung",
      "skill": [
        "HTML",
        "Python",
        "JavaScript(ES5)",
        "TypeScript(Vue)",
        "ESLint"
      ],
      "content": [
        "Guided students below high school level in learning foundational programming languages and provided assistance in completing their projects",
        "Developed a Classroom Student Record System, provided to teachers as a tool for enhancing instruction and recording classroom data"
      ],
      "link": "https://orangeapple.co/"
    },
    {
      "company": "MELODY PUBLISHING CO., LTD.",
      "time": "Oct 2018 - Jan 2019",
      "title": "Frontend Engineer Intern",
      "local": "Kaohsiung",
      "skill": [
        "HTML5",
        "JavaScript(ES5)"
      ],
      "content": [
        "Built online English teaching platform",
        "Assisted in organizing API documentation and specification files",
        "Developed interface content based on specification documents by using HTML5 and native JavaScript"
      ],
      "link": "https://melody.com.tw/"
    }
  ],
  "project": [
    {
      "title": "ShareHub",
      "detail": "ShareHub is an English article and image sharing platform that enables users to effortlessly share and explore interesting content.",
      "content": [
        "Built with Vue 3, Vite, Element Plus, and Tailwind CSS",
        "Designed for internal use within an English-speaking community in the company, with an estimated user base of approximately 30-50 users"
      ],
      "link": "https://crazwade.github.io/english-club/dist"
    },
    {
      "title": "NUK International Student Application System",
      "detail": "Designed for international students and administrative staff. The system facilitates online applications and provides comprehensive front-end and back-end functionalities to streamline the application process.",
      "content": [
        "Built with PHP, Native JavaScript(ES5) and MySQL",
        "Front-end: Empowering international students to apply to NUK by enabling document uploads, data entry, material downloads, and application progress tracking",
        "Back-end: Facilitating administrative staff at the international affairs office with tools for reviewing student submissions, conducting evaluations, and updating documents from the front-end"
      ]
    },
    {
      "title": "Backstage Management System",
      "detail": "Designed for administering operations involving data table display, manipulation, and export. Utilizes the Element Plus UI library to provide a rich user interface.",
      "content": [
        "Built with Vue 3, Vite, Element Plus, Pinia, Axios, and RESTful API",
        "This project showcases my ability to replicate backend systems based on work-related requirement"
      ],
      "link": "https://crazwade.github.io/BMS/dist"
    },
    {
      "title": "Classroom Student Record System",
      "detail": "Assist in organizing student information. Key features include student enrollment, drag-and-drop student repositioning, course selection, progress updates, and automated learning record creation.",
      "content": [
        "Built with Vue 3, Vite, Pinia, Element Plus, and Tailwind CSS",
        "This project is specially designed for project teaching teachers, and the estimated number of users is about 20"
      ],
      "link": "https://crazwade.github.io/CSR/dist/"
    },
    {
      "title": "LogViewer",
      "detail": "A log viewer system designed specifically for backend engineers in the company. It allows viewing and analyzing a large volume of log records.",
      "content": [
        "Built with Vue 3, Vite, Pinia, Element Plus, and Tailwind CSS",
        "The system utilizes Element Plus’s Virtualized Table to display log records, ensuring smooth performance even with large datasets."
      ],
      "link": "https://crazwade.github.io/LogViewer/"
    }
  ]
}
